code/openfoam/tutorials/multiRegion/CHT/reverseBurner/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication createZones

runApplication splitMeshRegions -cellZones "gas solid"

runApplication decomposePar -allRegions

runParallel foamMultiRun

runApplication reconstructPar -allRegions -newTimes

#------------------------------------------------------------------------------
